# Завдання 1: Робота зі списками та кортежами

# Створіть список з іменами кольорів, наприклад: 
#     "червоний", "синій", "зелений", і так далі. 
#     Потім створіть кортеж, що містить числа, які
#     представляють кількість букв у кожному з імен 
#     кольорів. Наприклад, якщо "червоний" має 7 букв, 
#     "синій" - 5 букв і так далі. Виведіть цей кортеж на 
#     екран і знайдіть загальну кількість букв у всіх іменах кольорів.

color_list = ['red', 'blue', 'green', 'yellow', 'black', 'white']

# (('red',3))
color_tuple = tuple((color, len(color)) for color in color_list)
print(color_tuple)

# Завдання 2: Маніпуляції зі множинами

# Створіть дві множини: 
# одну, яка містить числа від 1 до 10, 
# і іншу - числа від 5 до 15. 
# Виведіть обидві множини на екран. 
# Потім знайдіть та виведіть 
# об'єднання цих множин (елементи, що є в одній або обидвох множинах), 
# різницю (елементи, які є в першій, але не в другій множині), 
# та перетин (елементи, які є в обох множинах).

set1 = set(range(1, 11))
set2 = set(range(5, 16))

#1 Об'єднання
print(set1 | set2)
print(set1.union(set2))

#2 Різниця
print(set1 - set2)
print(set1.difference(set2))

#3 Перетин
print(set1 & set2)  
print(set1.intersection(set2))